/*
 *		File hanguljamon.c
 *		'2002.1.13
 *
 */


#include "libboree.h"


byte *_HangulJamoN[51] = {
	&(_HanFontN.F1[0][ 1][0]),		// 'ㄱ'	(초성, 종성)
	&(_HanFontN.F1[0][ 2][0]),		// 'ㄲ'	(복초성, 복종성)
	&(_HanFontN.F3[0][ 3][0]),		// 'ㄳ'	(복종성)
	&(_HanFontN.F1[0][ 3][0]),		// 'ㄴ'	(초성, 종성)
	&(_HanFontN.F3[0][ 5][0]),		// 'ㄵ'	(복종성)
	&(_HanFontN.F3[0][ 6][0]),		// 'ㄶ'	(복종성)
	&(_HanFontN.F1[0][ 4][0]),		// 'ㄷ'	(초성, 종성)
	&(_HanFontN.F1[0][ 5][0]),		// 'ㄸ'	(복초성)
	&(_HanFontN.F1[0][ 6][0]),		// 'ㄹ'	(초성, 종성)
	&(_HanFontN.F3[0][ 9][0]),		// 'ㄺ'	(복종성)
	&(_HanFontN.F3[0][10][0]),		// 'ㄻ'	(복종성)
	&(_HanFontN.F3[0][11][0]),		// 'ㄼ'	(복종성)
	&(_HanFontN.F3[0][12][0]),		// 'ㄽ'	(복종성)
	&(_HanFontN.F3[0][13][0]),		// 'ㄾ'	(복종성)
	&(_HanFontN.F3[0][14][0]),		// 'ㄿ'	(복종성)
	&(_HanFontN.F3[0][15][0]),		// 'ㅀ'	(복종성)
	&(_HanFontN.F1[0][ 7][0]),		// 'ㅁ'	(초성, 종성)
	&(_HanFontN.F1[0][ 8][0]),		// 'ㅂ'	(초성, 종성)
	&(_HanFontN.F1[0][ 9][0]),		// 'ㅃ'	(복초성)
	&(_HanFontN.F3[0][16][0]),		// 'ㅄ'	(복종성)
	&(_HanFontN.F1[0][10][0]),		// 'ㅅ'	(초성, 종성)
	&(_HanFontN.F1[0][11][0]),		// 'ㅆ'	(복초성, 복종성)
	&(_HanFontN.F1[0][12][0]),		// 'ㅇ'	(초성, 종성)
	&(_HanFontN.F1[0][13][0]),		// 'ㅈ'	(초성, 종성)
	&(_HanFontN.F1[0][14][0]),		// 'ㅉ'	(복초성)
	&(_HanFontN.F1[0][15][0]),		// 'ㅊ'	(초성, 종성)
	&(_HanFontN.F1[0][16][0]),		// 'ㅋ'	(초성, 종성)
	&(_HanFontN.F1[0][17][0]),		// 'ㅌ'	(초성, 종성)
	&(_HanFontN.F1[0][18][0]),		// 'ㅍ'	(초성, 종성)
	&(_HanFontN.F1[0][19][0]),		// 'ㅎ'	(초성, 종성)

	&(_HanFontN.F2[0][ 1][0]),		// 'ㅏ'
	&(_HanFontN.F2[0][ 2][0]),		// 'ㅐ'
	&(_HanFontN.F2[0][ 3][0]),		// 'ㅑ'
	&(_HanFontN.F2[0][ 4][0]),		// 'ㅒ'
	&(_HanFontN.F2[0][ 5][0]),		// 'ㅓ'
	&(_HanFontN.F2[0][ 6][0]),		// 'ㅔ'
	&(_HanFontN.F2[0][ 7][0]),		// 'ㅕ'
	&(_HanFontN.F2[0][ 8][0]),		// 'ㅖ'
	&(_HanFontN.F2[0][ 9][0]),		// 'ㅗ'
	&(_HanFontN.F2[0][10][0]),		// 'ㅘ'
	&(_HanFontN.F2[0][11][0]),		// 'ㅙ'
	&(_HanFontN.F2[0][12][0]),		// 'ㅚ'
	&(_HanFontN.F2[0][13][0]),		// 'ㅛ'
	&(_HanFontN.F2[0][14][0]),		// 'ㅜ'
	&(_HanFontN.F2[0][15][0]),		// 'ㅝ'
	&(_HanFontN.F2[0][16][0]),		// 'ㅞ'
	&(_HanFontN.F2[0][17][0]),		// 'ㅟ'
	&(_HanFontN.F2[0][18][0]),		// 'ㅠ'
	&(_HanFontN.F2[0][19][0]),		// 'ㅡ'
	&(_HanFontN.F2[0][20][0]),		// 'ㅢ'
	&(_HanFontN.F2[0][21][0])		// 'ㅣ'
};                       
