/*
 *		File hanguljamo.c
 *		'2002.1.13
 *
 */


#include "libboree.h"


byte *_HangulJamo[51] = {
	&(_HanFont.F1[0][ 1][0]),		// 'ㄱ'	(초성, 종성)		: 0xA4A1
	&(_HanFont.F1[0][ 2][0]),		// 'ㄲ'	(복초성, 복종성)	: 0xA4A2
	&(_HanFont.F3[0][ 3][0]),		// 'ㄳ'	(복종성)			: 0xA4A3
	&(_HanFont.F1[0][ 3][0]),		// 'ㄴ'	(초성, 종성)		: 0xA4A4
	&(_HanFont.F3[0][ 5][0]),		// 'ㄵ'	(복종성)			: 0xA4A5
	&(_HanFont.F3[0][ 6][0]),		// 'ㄶ'	(복종성)			: 0xA4A6
	&(_HanFont.F1[0][ 4][0]),		// 'ㄷ'	(초성, 종성)		: 0xA4A7
	&(_HanFont.F1[0][ 5][0]),		// 'ㄸ'	(복초성)			: 0xA4A8
	&(_HanFont.F1[0][ 6][0]),		// 'ㄹ'	(초성, 종성)		: 0xA4A9
	&(_HanFont.F3[0][ 9][0]),		// 'ㄺ'	(복종성)			: 0xA4AA
	&(_HanFont.F3[0][10][0]),		// 'ㄻ'	(복종성)            : 0xA4AB
	&(_HanFont.F3[0][11][0]),		// 'ㄼ'	(복종성)            : 0xA4AC
	&(_HanFont.F3[0][12][0]),		// 'ㄽ'	(복종성)            : 0xA4AD
	&(_HanFont.F3[0][13][0]),		// 'ㄾ'	(복종성)            : 0xA4AE
	&(_HanFont.F3[0][14][0]),		// 'ㄿ'	(복종성)            : 0xA4AF
	&(_HanFont.F3[0][15][0]),		// 'ㅀ'	(복종성)            : 0xA4B0
	&(_HanFont.F1[0][ 7][0]),		// 'ㅁ'	(초성, 종성)        : 0xA4B1
	&(_HanFont.F1[0][ 8][0]),		// 'ㅂ'	(초성, 종성)        : 0xA4B2
	&(_HanFont.F1[0][ 9][0]),		// 'ㅃ'	(복초성)			: 0xA4B3
	&(_HanFont.F3[0][16][0]),		// 'ㅄ'	(복종성)            : 0xA4B4
	&(_HanFont.F1[0][10][0]),		// 'ㅅ'	(초성, 종성)        : 0xA4B5
	&(_HanFont.F1[0][11][0]),		// 'ㅆ'	(복초성, 복종성)    : 0xA4B6
	&(_HanFont.F1[0][12][0]),		// 'ㅇ'	(초성, 종성)        : 0xA4B7
	&(_HanFont.F1[0][13][0]),		// 'ㅈ'	(초성, 종성)        : 0xA4B8
	&(_HanFont.F1[0][14][0]),		// 'ㅉ'	(복초성)            : 0xA4B9
	&(_HanFont.F1[0][15][0]),		// 'ㅊ'	(초성, 종성)        : 0xA4BA
	&(_HanFont.F1[0][16][0]),		// 'ㅋ'	(초성, 종성)        : 0xA4BB
	&(_HanFont.F1[0][17][0]),		// 'ㅌ'	(초성, 종성)		: 0xA4BC
	&(_HanFont.F1[0][18][0]),		// 'ㅍ'	(초성, 종성)        : 0xA4BD
	&(_HanFont.F1[0][19][0]),		// 'ㅎ'	(초성, 종성)        : 0xA4BE
	
	&(_HanFont.F2[0][ 1][0]),		// 'ㅏ'		: 0xA4BF
	&(_HanFont.F2[0][ 2][0]),		// 'ㅐ'		: 0xA4C0
	&(_HanFont.F2[0][ 3][0]),		// 'ㅑ'		: 0xA4C1
	&(_HanFont.F2[0][ 4][0]),		// 'ㅒ'		: 0xA4C2
	&(_HanFont.F2[0][ 5][0]),		// 'ㅓ'		: 0xA4C3
	&(_HanFont.F2[0][ 6][0]),		// 'ㅔ'		: 0xA4C4
	&(_HanFont.F2[0][ 7][0]),		// 'ㅕ'		: 0xA4C5
	&(_HanFont.F2[0][ 8][0]),		// 'ㅖ'		: 0xA4C6
	&(_HanFont.F2[0][ 9][0]),		// 'ㅗ'		: 0xA4C7
	&(_HanFont.F2[0][10][0]),		// 'ㅘ'		: 0xA4C8
	&(_HanFont.F2[0][11][0]),		// 'ㅙ'		: 0xA4C9
	&(_HanFont.F2[0][12][0]),		// 'ㅚ'		: 0xA4CA
	&(_HanFont.F2[0][13][0]),		// 'ㅛ'		: 0xA4CB
	&(_HanFont.F2[0][14][0]),		// 'ㅜ'		: 0xA4CC
	&(_HanFont.F2[0][15][0]),		// 'ㅝ'		: 0xA4CD
	&(_HanFont.F2[0][16][0]),		// 'ㅞ'		: 0xA4CE
	&(_HanFont.F2[0][17][0]),		// 'ㅟ'		: 0xA4CF
	&(_HanFont.F2[0][18][0]),		// 'ㅠ'		: 0xA4D0
	&(_HanFont.F2[0][19][0]),		// 'ㅡ'		: 0xA4D1
	&(_HanFont.F2[0][20][0]),		// 'ㅢ'		: 0xA4D2
	&(_HanFont.F2[0][21][0])		// 'ㅣ'		: 0xA4D3
};

